Tekla Open API Reference for Tekla Structures 2025
ControlArc.Geometry Property
 Gets or sets the arc geometry. The arc must not represent a complete circle (i.e. the arc angle must be less than 360 degrees).
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Arc Geometry { get; set; }
Public Property Geometry As Arc
	Get
	Set
Property Value
Type: Arc
Exceptions
Exception | Condition
ArgumentException | Thrown if the input arc is a complete circle
See Also
Reference
ControlArc Class
Tekla.Structures.Model Namespace